; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   yellow_block_1 brown_block_2 black_block_1 purple_block_1 brown_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (hold_1) (hold_2) (seen_psi_3))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty) (not (and (ontable purple_block_1) (not (= ?obj purple_block_1)))) (or (and (ontable yellow_block_1) (not (= ?obj yellow_block_1))) (seen_psi_3)))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (and (not (and (clear brown_block_1) (not (= ?obj brown_block_1)))) (not (and (clear black_block_1) (not (= ?obj black_block_1))))) (hold_0)) (when (or (not (and (ontable brown_block_1) (not (= ?obj brown_block_1)))) (= ?obj brown_block_1) (holding brown_block_1)) (hold_1)) (when (not (and (ontable yellow_block_1) (not (= ?obj yellow_block_1)))) (hold_2)) (when (or (on brown_block_2 purple_block_1) (not (and (clear brown_block_1) (not (= ?obj brown_block_1))))) (seen_psi_3)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj) (not (or (= ?obj purple_block_1) (ontable purple_block_1))) (or (= ?obj yellow_block_1) (ontable yellow_block_1) (seen_psi_3)))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (and (not (or (= ?obj brown_block_1) (clear brown_block_1))) (not (or (= ?obj black_block_1) (clear black_block_1)))) (hold_0)) (when (or (not (or (= ?obj brown_block_1) (ontable brown_block_1))) (and (holding brown_block_1) (not (= ?obj brown_block_1)))) (hold_1)) (when (not (or (= ?obj yellow_block_1) (ontable yellow_block_1))) (hold_2)) (when (or (on brown_block_2 purple_block_1) (not (or (= ?obj brown_block_1) (clear brown_block_1)))) (seen_psi_3)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (and (not (or (= ?obj brown_block_1) (and (clear brown_block_1) (not (= ?underobj brown_block_1))))) (not (or (= ?obj black_block_1) (and (clear black_block_1) (not (= ?underobj black_block_1)))))) (hold_0)) (when (or (not (ontable brown_block_1)) (and (holding brown_block_1) (not (= ?obj brown_block_1)))) (hold_1)) (when (or (and (= ?obj brown_block_2) (= ?underobj purple_block_1)) (on brown_block_2 purple_block_1) (not (or (= ?obj brown_block_1) (and (clear brown_block_1) (not (= ?underobj brown_block_1)))))) (seen_psi_3)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (and (not (or (= ?underobj brown_block_1) (and (clear brown_block_1) (not (= ?obj brown_block_1))))) (not (or (= ?underobj black_block_1) (and (clear black_block_1) (not (= ?obj black_block_1)))))) (hold_0)) (when (or (not (ontable brown_block_1)) (= ?obj brown_block_1) (holding brown_block_1)) (hold_1)) (when (or (and (on brown_block_2 purple_block_1) (not (and (= ?obj brown_block_2) (= ?underobj purple_block_1)))) (not (or (= ?underobj brown_block_1) (and (clear brown_block_1) (not (= ?obj brown_block_1)))))) (seen_psi_3)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
 )
 (:init (ontable yellow_block_1) (ontable brown_block_1) (on brown_block_2 yellow_block_1) (on purple_block_1 brown_block_2) (ontable black_block_1) (clear brown_block_1) (clear purple_block_1) (clear black_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (on yellow_block_1 brown_block_2) (hold_0) (hold_1) (hold_2)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack purple_block_1 brown_block_2)
   deleted: (on purple_block_1 brown_block_2) (clear purple_block_1) (handempty)
   added: (holding purple_block_1) (clear brown_block_2)
   goals met: 0 of 4
2. (stack purple_block_1 black_block_1)
   deleted: (clear black_block_1) (holding purple_block_1)
   added: (handempty) (clear purple_block_1) (on purple_block_1 black_block_1)
   goals met: 0 of 4
3. (unstack brown_block_2 yellow_block_1)
   deleted: (on brown_block_2 yellow_block_1) (clear brown_block_2) (handempty)
   added: (holding brown_block_2) (clear yellow_block_1)
   goals met: 0 of 4
4. (stack brown_block_2 purple_block_1)
   deleted: (clear purple_block_1) (holding brown_block_2)
   added: (handempty) (clear brown_block_2) (on brown_block_2 purple_block_1) (seen_psi_3)
   goals met: 0 of 4
5. (pickup yellow_block_1)
   deleted: (clear yellow_block_1) (ontable yellow_block_1) (handempty)
   added: (holding yellow_block_1) (hold_2)
   goals met: 1 of 4
6. (stack yellow_block_1 brown_block_2)
   deleted: (clear brown_block_2) (holding yellow_block_1)
   added: (handempty) (clear yellow_block_1) (on yellow_block_1 brown_block_2)
   goals met: 2 of 4
7. (pickup brown_block_1)
   deleted: (clear brown_block_1) (ontable brown_block_1) (handempty)
   added: (holding brown_block_1) (hold_0) (hold_1)
   goals met: 4 of 4
